# Bank Loan Creation

I've crafted a Python script designed to generate and compile INSERT statements.

Importing the packages

In [1]:
import pandas as pd

Reading the csv

In [2]:
#Read csv
df=pd.read_csv("financial_loan.csv")
df.head()

,id,address_state,application_type,emp_length,emp_title,grade,home_ownership,issue_date,last_credit_pull_date,last_payment_date,...,sub_grade,term,verification_status,annual_income,dti,installment,int_rate,loan_amount,total_acc,total_payment
0,1077430,GA,INDIVIDUAL,< 1 year,Ryder,C,RENT,11-02-2021,13-09-2021,13-04-2021,...,C4,60 months,Source Verified,30000.0,0.0100,59.83,0.1527,2500,4,1009
1,1072053,CA,INDIVIDUAL,9 years,MKC Accounting,E,RENT,01-01-2021,14-12-2021,15-01-2021,...,E1,36 months,Source Verified,48000.0,0.0535,109.43,0.1864,3000,4,3939
2,1069243,CA,INDIVIDUAL,4 years,Chemat Technology Inc,C,RENT,05-01-2021,12-12-2021,09-01-2021,...,C5,36 months,Not Verified,50000.0,0.2088,421.65,0.1596,12000,11,3522
3,1041756,TX,INDIVIDUAL,< 1 year,barnes distribution,B,MORTGAGE,25-02-2021,12-12-2021,12-03-2021,...,B2,60 months,Source Verified,42000.0,0.0540,97.06,0.1065,4500,9,4911
4,1068350,IL,INDIVIDUAL,10+ years,J&J Steel Inc,A,MORTGAGE,01-01-2021,14-12-2021,15-01-2021,...,A1,36 months,Verified,83000.0,0.0231,106.53,0.0603,3500,28,3835

Checking the number of rows and columns

In [3]:
#Shape of the dataframe
df.shape

(38576, 24)

Checking the datatype of the columns

In [4]:
#Info of dataframe
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 38576 entries, 0 to 38575
Data columns (total 24 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   id                     38576 non-null  int64
 1   address_state          38576 non-null  object
 2   application_type       38576 non-null  object
 3   emp_length             38576 non-null  object
 4   emp_title              37138 non-null  object
 5   grade                  38576 non-null  object
 6   home_ownership         38576 non-null  object
 7   issue_date             38576 non-null  object
 8   last_credit_pull_date  38576 non-null  object
 9   last_payment_date      38576 non-null  object
 10  loan_status            38576 non-null  object
 11  next_payment_date      38576 non-null  object
 12  member_id              38576 non-null  int64
 13  purpose                38576 non-null  object
 14  sub_grade              38576 non-null  object
 15  term                   38576 non-null  object
 16  verification_status    38576 non-null  object
 17  annual_income          38576 non-null  float64
 18  dti                    38576 non-null  float64
 19  installment            38576 non-null  float64
 20  int_rate               38576 non-null  float64
 21  loan_amount            38576 non-null  int64
 22  total_acc              38576 non-null  int64
 23  total_payment          38576 non-null  int64
dtypes: float64(4), int64(5), object(15)
memory usage: 7.1+ MB

Checking the null values

In [5]:
#Null values
df.isna().sum()

id                          0
address_state               0
application_type            0
emp_length                  0
emp_title                1438
grade                       0
home_ownership              0
issue_date                  0
last_credit_pull_date       0
last_payment_date           0
loan_status                 0
next_payment_date           0
member_id                   0
purpose                     0
sub_grade                   0
term                        0
verification_status         0
annual_income               0
dti                         0
installment                 0
int_rate                    0
loan_amount                 0
total_acc                   0
total_payment               0
dtype: int64

Table created using MySQL in SQL workbench.



Table Structure:


| Column Name          | Data Type       | Constraints       |
|----------------------|-----------------|-------------------|
| id                   | INT             | NOT NULL, PRIMARY KEY |
| address_state        | VARCHAR(50)     | NOT NULL          |
| application_type     | VARCHAR(50)     | NOT NULL          |
| emp_length           | VARCHAR(50)     | NOT NULL          |
| emp_title            | VARCHAR(150)    |                   |
| grade                | VARCHAR(50)     | NOT NULL          |
| home_ownership       | VARCHAR(50)     | NOT NULL          |
| issue_date           | DATE            | NOT NULL          |
| last_credit_pull_date| DATE            | NOT NULL          |
| last_payment_date    | DATE            | NOT NULL          |
| loan_status          | VARCHAR(50)     | NOT NULL          |
| next_payment_date    | DATE            | NOT NULL          |
| member_id            | INT             | NOT NULL          |
| purpose              | VARCHAR(50)     | NOT NULL          |
| sub_grade            | VARCHAR(50)     | NOT NULL          |
| term                 | VARCHAR(50)     | NOT NULL          |
| verification_status  | VARCHAR(50)     | NOT NULL          |
| annual_income        | FLOAT           | NOT NULL          |
| dti                  | FLOAT           | NOT NULL          |
| installment          | FLOAT           | NOT NULL          |
| int_rate             | FLOAT           | NOT NULL          |
| loan_amount          | INT             | NOT NULL          |
| total_acc            | TINYINT         | NOT NULL          |
| total_payment        | INT             | NOT NULL          |

Making changes to the data from the csv and writing INSERT statements.

In [6]:
from datetime import datetime

# Schema name
schema_name = 'bank_loan'
#Table name
table_name = 'financial_loan'

# Converting date columns to the correct datetime format
date_columns = ['issue_date', 'last_credit_pull_date', 'last_payment_date', 'next_payment_date']
for col in date_columns:
    df[col] = df[col].apply(lambda x: datetime.strptime(x, '%d-%m-%Y').strftime('%Y-%m-%d'))
    
# Converting 'nan' strings to None values in the DataFrame
df.replace('nan', None, inplace=True)

# SQL insert statements
sql_statements = []
for _, row in df.iterrows():
    # Generating SQL values, replacing Python None with 'NULL'
    values = ', '.join([
        f'"{value}"' if isinstance(value, str) and value is not None else  # Wrapping string values in double quotes
        'NULL' if pd.isna(value) else  # Else replacing NaN values with 'NULL'
        str(value) for value in row  # Else converting values to strings
    # Appending the SQL insert statement to the list
    sql_statements.append(f"INSERT INTO {schema_name}.{table_name} VALUES ({values});")

# Writing SQL insert statements to a SQL file
with open('Part_I_Financial_Loan_SQL_Creation.sql', 'a') as f:
    f.write('\n'.join(sql_statements))

Successfully wrote INSERT statements with the python. 
To prevent errors during CSV import into MySQL Workbench, I've employed this approach, though it might not be the most optimal one.